import Navbar from "../../compnent/navbar/Navbar";

function About() {
  return (
      <>
      <Navbar/>
      <h1 className="mt-10 text-xl p-5 font-bold">درباره ما </h1>
      <p className="px-5">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است
      </p>
    </>
  );
}
export default About
